### <center> ASSIGNMENT

In [2]:
import pandas as pd

1.

In [10]:
lst = [4, 8, 15, 16, 23, 42]
ser = pd.Series(lst)
print(ser)
print(type(ser))

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64
<class 'pandas.core.series.Series'>

2.

In [9]:
lst = [x for x in range(1,20,2)]
ser = pd.Series(lst)
print(ser)
print(type(ser))

0     1
1     3
2     5
3     7
4     9
5    11
6    13
7    15
8    17
9    19
dtype: int64
<class 'pandas.core.series.Series'>

3.

In [14]:
data = {'Name': ['Alice', 'Bob', 'Claire'],
        'Age': [25, 30, 27],
        'Gender' : ['Female','Male','Female']}
df = pd.DataFrame(data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

4.

Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns).
Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index.

Differences between dataframe and series are-  

| Pandas Series | Pandas DataFrame |
| --- | --- |
| One-dimensional | Two-dimensional |
| Homogenous – Series elements must be of the same data type. | Heterogenous – DataFrame elements can have different data types. |
| Size-immutable – Once created, the size of a Series object cannot be changed. | Size-mutable – Elements can be dropped or added in an existing DataFrame. |

5.

Some common functions used to manipulate data in DataFrame are-

df.drop() - Used to drop rows and columns in dataframe.  
Ex-

In [26]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [27]:
df_new = df.drop('Name',axis=1)
df_new

   Age  Gender
0   25  Female
1   30    Male
2   27  Female

In [28]:
df_new = df_new.drop(1,axis=0)
df_new

   Age  Gender
0   25  Female
2   27  Female

df.rename() - Used to rename columns in a dataframe.

In [30]:
df_new = df_new.rename(columns={'Age':'age','Gender':'gender'})
df_new

   age  gender
0   25  Female
2   27  Female

df.select_dtypes() - Select column with specific data types.

In [31]:
int_data = df_new.select_dtypes('int')
int_data

   age
0   25
2   27

df.iloc[] - Slicing the dataset
df.loc[] - Using column names to slice

In [34]:
df_new.iloc[:1,0]

0    25
Name: age, dtype: int64

In [37]:
df_new.loc[:2,'gender']

0    Female
2    Female
Name: gender, dtype: object

6.

Series - Size immutable, Data mutable
Dataframe - Size mutable, Data mutable
Panel - Size mutable, Data mutable

7.

In [39]:
name = ['Raj','Mohan','Rahul']
age = [30,45,27]
weight = [63,56,70]

name_ser = pd.Series(name)
age_ser = pd.Series(age)
weight_ser = pd.Series(weight)

frame = {'Name': name_ser, 'Age': age_ser, 'Weight': weight_ser}
df = pd.DataFrame(frame)
print(df)

    Name  Age  Weight
0    Raj   30      63
1  Mohan   45      56
2  Rahul   27      70